hiramrodriguez14/HAWT-Load_Control_and_UI/load_ui_control.syscfg
RTCB.calYear     = 2026;
RTCB.calMonth    = "5";
RTCB.calDOM      = 4;
RTCB.calDOW      = "4";
RTCB.enableClock = true;

SPI1.enableDMAEvent1                    = false;
SPI1.enableDMAEvent2                    = false;
SPI1.spiClkSrc                          = "MFCLK";
SPI1.spiClkDiv                          = "4";
SPI1.frameFormat                        = "MOTO3";
SPI1.chipSelect                         = [];
SPI1.phase                              = "1";
SPI1.targetBitRate                      = 500000;
SPI1.rxFifoThreshold                    = "DL_SPI_RX_FIFO_LEVEL_ONE_FRAME";
SPI1.txFifoThreshold                    = "DL_SPI_TX_FIFO_LEVEL_ONE_FRAME";
SPI1.$name                              = "INA229_RECT_SPI0";
SPI1.sclkPinConfig.direction            = scripting.forceWrite("OUTPUT");
SPI1.sclkPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI1.sclkPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI1.sclkPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric0";
SPI1.mosiPinConfig.direction            = scripting.forceWrite("OUTPUT");
SPI1.mosiPinConfig.hideOutputInversion  = scripting.forceWrite(false);
SPI1.mosiPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI1.mosiPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI1.mosiPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric1";
SPI1.misoPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI1.misoPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI1.misoPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric2";
SPI1.peripheral.$assign                 = "SPI0";
SPI1.peripheral.sclkPin.$assign         = "PA12";
SPI1.peripheral.mosiPin.$assign         = "PA14";
SPI1.peripheral.misoPin.$assign         = "PA13";

SPI2.targetBitRate                      = 500000;
SPI2.frameFormat                        = "MOTO3";
SPI2.phase                              = "1";
SPI2.rxFifoThreshold                    = "DL_SPI_RX_FIFO_LEVEL_ONE_FRAME";
SPI2.txFifoThreshold                    = "DL_SPI_TX_FIFO_LEVEL_ONE_FRAME";
SPI2.$name                              = "INA229_BATTERY_SPI1";
SPI2.sclkPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric8";
SPI2.sclkPinConfig.direction            = scripting.forceWrite("OUTPUT");
SPI2.sclkPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI2.sclkPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI2.mosiPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric9";
SPI2.mosiPinConfig.direction            = scripting.forceWrite("OUTPUT");
SPI2.mosiPinConfig.hideOutputInversion  = scripting.forceWrite(false);
SPI2.mosiPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI2.mosiPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI2.misoPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric10";
SPI2.misoPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI2.misoPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI2.peripheral.sclkPin.$assign         = "PA17";
SPI2.peripheral.mosiPin.$assign         = "PA18";
SPI2.peripheral.misoPin.$assign         = "PA16";

SPI3.frameFormat                        = "MOTO3";
SPI3.chipSelect                         = [];
SPI3.enableDMAEvent1                    = false;
SPI3.enableDMAEvent2                    = false;
SPI3.$name                              = "SD_CARD_SPI_2";
SPI3.sclkPinConfig.direction            = scripting.forceWrite("OUTPUT");
SPI3.sclkPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI3.sclkPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI3.sclkPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric11";
SPI3.mosiPinConfig.direction            = scripting.forceWrite("OUTPUT");
SPI3.mosiPinConfig.hideOutputInversion  = scripting.forceWrite(false);
SPI3.mosiPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI3.mosiPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI3.mosiPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric12";
SPI3.misoPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI3.misoPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI3.misoPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric13";
SPI3.peripheral.sclkPin.$assign         = "PA10";
SPI3.peripheral.mosiPin.$assign         = "PB4";
SPI3.peripheral.misoPin.$assign         = "PB5";

SYSCTL.forceDefaultClkConfig = true;
SYSCTL.MFCLKEn               = true;

TIMER1.timerClkSrc        = "LFCLK";
TIMER1.timerMode          = "PERIODIC_UP";
TIMER1.timerStartTimer    = true;
TIMER1.interrupts         = ["ZERO"];
TIMER1.timerPeriod        = "50 ms";
TIMER1.$name              = "CONVERTERS_TIMER";
TIMER1.peripheral.$assign = "TIMA0";

TIMER2.timerClkSrc        = "LFCLK";
TIMER2.timerMode          = "PERIODIC_UP";
TIMER2.timerStartTimer    = true;
TIMER2.timerPeriod        = "2 s";
TIMER2.$name              = "UART_TIMER";
TIMER2.interrupts         = ["ZERO"];
TIMER2.peripheral.$assign = "TIMA1";

UART1.$name                    = "UART_0";
UART1.enableFIFO               = true;
UART1.rxFifoThreshold          = "DL_UART_RX_FIFO_LEVEL_ONE_ENTRY";
UART1.enableDMARX              = false;
UART1.enableDMATX              = false;
UART1.peripheral.$assign       = "UART0";
UART1.peripheral.rxPin.$assign = "PA11";
UART1.peripheral.txPin.$assign = "PA28";
UART1.txPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric3";
UART1.rxPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric4";

UART2.enableFIFO                       = true;
UART2.rxFifoThreshold                  = "DL_UART_RX_FIFO_LEVEL_ONE_ENTRY";
UART2.enabledInterrupts                = ["RX","RX_TIMEOUT_ERROR"];
UART2.$name                            = "UART_TURBINE";
UART2.peripheral.rxPin.$assign         = "PA6";
UART2.peripheral.txPin.$assign         = "PA8";
UART2.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART2.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART2.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART2.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART2.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric14";
UART2.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART2.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART2.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART2.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric15";

const ProjectConfig              = scripting.addModule("/ti/project_config/ProjectConfig", {}, false);
ProjectConfig.migrationCondition = true;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
GPIO1.associatedPins[0].pin.$suggestSolution  = "PB19";
Board.peripheral.$suggestSolution             = "DEBUGSS";
Board.peripheral.swclkPin.$suggestSolution    = "PA20";
Board.peripheral.swdioPin.$suggestSolution    = "PA19";
GPIO2.associatedPins[0].pin.$suggestSolution  = "PB2";
GPIO3.associatedPins[0].pin.$suggestSolution  = "PA15";
GPIO4.associatedPins[0].pin.$suggestSolution  = "PB18";
GPIO5.associatedPins[0].pin.$suggestSolution  = "PB17";
GPIO6.associatedPins[0].pin.$suggestSolution  = "PA7";
GPIO7.associatedPins[0].pin.$suggestSolution  = "PA31";
GPIO7.associatedPins[1].pin.$suggestSolution  = "PA3";
GPIO7.associatedPins[2].pin.$suggestSolution  = "PA4";
GPIO7.associatedPins[3].pin.$suggestSolution  = "PA5";
GPIO7.associatedPins[4].pin.$suggestSolution  = "PB0";
GPIO7.associatedPins[5].pin.$suggestSolution  = "PB1";
GPIO8.associatedPins[0].pin.$suggestSolution  = "PB27";
GPIO8.associatedPins[1].pin.$suggestSolution  = "PB26";
GPIO8.associatedPins[2].pin.$suggestSolution  = "PB25";
GPIO8.associatedPins[3].pin.$suggestSolution  = "PA25";
GPIO9.associatedPins[0].pin.$suggestSolution  = "PA27";
GPIO9.associatedPins[1].pin.$suggestSolution  = "PA26";
GPIO9.associatedPins[2].pin.$suggestSolution  = "PA24";
GPIO9.associatedPins[3].pin.$suggestSolution  = "PB23";
GPIO9.associatedPins[4].pin.$suggestSolution  = "PB24";
GPIO10.associatedPins[0].pin.$suggestSolution = "PB3";
GPIO11.associatedPins[0].pin.$suggestSolution = "PB12";
I2C1.peripheral.$suggestSolution              = "I2C2";
PWM1.peripheral.$suggestSolution              = "TIMG7";
RTCB.peripheral.$suggestSolution              = "LFSS";
SPI2.peripheral.$suggestSolution              = "SPI1";
SPI3.peripheral.$suggestSolution              = "SPI2";
SYSCTL.peripheral.$suggestSolution            = "SYSCTL";
UART2.peripheral.$suggestSolution             = "UART1";
